tap "cloudflare/cloudflare"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "k14s/homebrew-tap"
tap "mongodb/brew"
tap "thoughtbot/formulae"

brew "autoconf"
brew "automake"
brew "awscli"
brew "caddy"
brew "cairo"
brew "calicoctl"
brew "cloudflare/cloudflare/cloudflared"
brew "cmake"
brew "confuse"
brew "coreutils"
brew "ctags"
brew "curl"
brew "docker-compose"
brew "fontconfig"
brew "freetype"
brew "gdbm"
brew "gettext"
brew "git"
brew "glib"
brew "gnupg"
brew "graphviz"
brew "heroku/brew/heroku"
brew "hey"
brew "hivemind"
brew "htop"
brew "iftop"
brew "imagemagick"
brew "iperf3"
brew "jpeg"
brew "jpegoptim"
brew "jq"
brew "k6"
brew "kind"
brew "kops"
brew "kubectx"
brew "kubeseal"
brew "kustomize"
brew "libevent"
brew "libffi"
brew "libpng"
brew "librsvg"
brew "libtiff"
brew "libtool"
brew "libxslt"
brew "libyaml"
brew "linkerd"
brew "mas"
brew "mkcert"
brew "mongodb/brew/mongodb-community-shell"
brew "nginx"
brew "node"
brew "nss"
brew "openconnect"
brew "openssl@1.1"
brew "optipng"
brew "overmind"
brew "pango"
brew "pcre"
brew "perl"
brew "pgcli"
brew "pinentry-mac"
brew "pinentry"
brew "pixman"
brew "pkg-config"
brew "postgresql"
brew "python"
brew "sops"
brew "step"
brew "stern"
brew "telnet"
brew "thoughtbot/formulae/rcm"
brew "tree"
brew "unixodbc"
brew "unzip"
brew "urlview"
brew "watch"
brew "wget"
brew "wxmac"
brew "yarn"
brew "youtube-dl"
brew "yq"
brew "ytt"
brew "zsh-completions"
brew "zsh"

cask "1password"
cask "adguard"
cask "adobe-creative-cloud"
cask "alacritty"
cask "altair-graphql-client"
cask "apple-hewlett-packard-printer-drivers"
cask "chromedriver"
cask "clickup"
cask "docker-edge"
cask "encryptme"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "font-source-code-pro"
cask "google-chrome"
cask "hp-easy-start"
cask "insomnia"
cask "iterm2"
cask "kitty"
cask "mongodb-compass"
cask "nosql-workbench"
cask "notion"
cask "onyx"
cask "parsec"
cask "postman"
cask "qobuz"
cask "roon"
cask "setapp"
cask "slack"
cask "telegram-desktop"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "yandex-cloud-cli"
cask "zoom"

mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Monosnap", id: 540348655
mas "NextDNS", id: 1464122853
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder", id: 1449412482
mas "Tweetbot", id: 1384080005
mas "Xcode", id: 497799835
