# Brewfile for Linux/WSL
# Install Homebrew on Linux: https://docs.brew.sh/Homebrew-on-Linux
# Usage: brew bundle --file=~/.Brewfile.linux

tap "kenn-io/tap"
tap "terror/tap"

# CLI Tools & Development
brew "act"
brew "argocd"
brew "autoconf"
brew "automake"
brew "awscli"
brew "biome"
brew "caddy"
brew "cairo"
brew "calicoctl"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "ctags"
brew "curl"
brew "doctl"
brew "eksctl"
brew "ethereum"
brew "ffmpeg"
brew "flux"
brew "flyctl"
brew "gh"
brew "git"
brew "glab"
brew "gnupg"
brew "hivemind"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "iftop"
brew "imagemagick"
brew "iperf3"
brew "jpegoptim"
brew "jq"
brew "just"
brew "k6"
brew "kenn-io/tap/roborev", trusted: true
brew "kind"
brew "kops"
brew "kubectx"
brew "kubeseal"
brew "kubie"
brew "kustomize"
brew "linkerd"
brew "markdownlint-cli2"
brew "minikube"
brew "mkcert"
brew "nats-server"
brew "nginx"
brew "openclaw-cli"
brew "openconnect"
brew "openssl"
brew "optipng"
brew "overmind"
brew "perl"
brew "pkg-config"
brew "pnpm"
brew "podman"
brew "poppler"
brew "rcm"
brew "redis"
brew "rustup"
brew "shellcheck"
brew "sops"
brew "sox"
brew "sqlite"
brew "step"
brew "stern"
brew "svn"
brew "telnet"
brew "terror/tap/just-lsp", trusted: true
brew "tmux"
brew "tree"
brew "unzip"
brew "urlview"
brew "uv"
brew "watch"
brew "wget"
brew "wxwidgets"
brew "yt-dlp"
brew "ytt"
brew "zsh-completions"

# Native installers (preferred over Homebrew casks on Linux):
# - Claude Code: installed by `just setup`
# - Hermes Agent: installed by `just setup`
# - 1Password: https://1password.com/downloads/linux/
# - Docker: apt install docker.io
# - gcloud CLI: https://cloud.google.com/sdk/docs/install#linux
# - Gemini CLI: no Linux brew replacement (the antigravity-cli cask is
#   macOS-only) — install via Google's official channel if needed
# - Ghostty: https://ghostty.org/docs/install/binary
# - VS Code: https://code.visualstudio.com/docs/setup/linux
