tap "cloudflare/cloudflare"
tap "earthly/earthly"
tap "ethereum/ethereum"
tap "fewlines-education/tap"
tap "fluxcd/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "nats-io/nats-tools"
tap "qovery/qovery-cli"
tap "sal0max/nikon"
tap "superfly/tap"
tap "thoughtbot/formulae"
tap "vmware-tanzu/carvel"
tap "weaveworks/tap"

brew "argocd"
brew "autoconf"
brew "automake"
brew "awscli"
brew "caddy"
brew "cairo"
brew "calicoctl"
brew "cloudflare-wrangler2"
brew "cloudflare/cloudflare/cloudflared"
brew "cmake"
brew "confuse"
brew "coreutils"
brew "ctags"
brew "curl"
brew "doctl"
brew "earthly/earthly/earthly"
brew "ethereum"
brew "fewlines-education/tap/sparta-cli"
brew "fluxcd/tap/flux"
brew "fontconfig"
brew "fop"
brew "freetype"
brew "gdbm"
brew "gettext"
brew "gh"
brew "git"
brew "glib"
brew "gnupg"
brew "graphviz"
brew "heroku/brew/heroku"
brew "hey"
brew "hivemind"
brew "htop"
brew "iftop"
brew "imagemagick"
brew "iperf3"
brew "java"
brew "jpeg"
brew "jpegoptim"
brew "jq"
brew "k6"
brew "kind"
brew "kops"
brew "kubectx"
brew "kubeseal"
brew "kubie"
brew "kustomize"
brew "libevent"
brew "libffi"
brew "libpng"
brew "librsvg"
brew "libtiff"
brew "libtool"
brew "libxslt"
brew "libyaml"
brew "linkerd"
brew "mkcert"
brew "mongodb/brew/mongodb-community-shell"
brew "nats-io/nats-tools/nats"
brew "nginx"
brew "node"
brew "nss"
brew "openconnect"
brew "openssl"
brew "openssl@1.1"
brew "optipng"
brew "overmind"
brew "pango"
brew "pcre"
brew "perl"
brew "pgcli"
brew "pinentry"
brew "pinentry-mac"
brew "pixman"
brew "pkg-config"
brew "podman"
brew "postgresql@15"
brew "python"
brew "qovery-cli"
brew "redis"
brew "rustup-init"
brew "sops"
brew "speedtest-cli"
brew "sshuttle"
brew "step"
brew "stern"
brew "superfly/tap/flyctl"
brew "svn"
brew "sysbench"
brew "telnet"
brew "thoughtbot/formulae/rcm"
brew "tree"
brew "unixodbc"
brew "unzip"
brew "urlview"
brew "vmware-tanzu/carvel/ytt"
brew "watch"
brew "weaveworks/tap/eksctl"
brew "wget"
brew "wxwidgets"
brew "yarn"
brew "youtube-dl"
brew "yq"
brew "yt-dlp"
brew "zsh-completions"

cask "1password-cli"
cask "1password"
cask "adobe-creative-cloud"
cask "balance-lock"
cask "battle-net"
cask "canon-eos-utility"
cask "canon-eos-webcam-utility"
cask "chromedriver"
cask "discord"
cask "docker"
cask "elgato-game-capture-hd"
cask "expressvpn"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "font-source-code-pro"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "ledger-live"
cask "linear-linear"
cask "little-snitch"
cask "logitech-camera-settings"
cask "microsoft-office"
cask "microsoft-teams"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "parsec"
cask "postman"
cask "rectangle"
cask "reflect"
cask "rode-central"
cask "session-manager-plugin"
cask "setapp"
cask "slack"
cask "spotify"
cask "synology-drive"
cask "tailscale"
cask "visual-studio-code"
cask "vlc"
